
## Plan Result (aat)




<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.org-role-mapping-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.org-role-mapping-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.org-role-mapping-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.org-role-mapping-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.org-role-mapping-database-v15.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "am-org-role-mapping-service-postgres-db-v15-action_group"
      + resource_group_name = "am-org-role-mapping-service-postgres-db-v15-data-aat"
      + short_name          = "am-org-role-"
      + tags                = {
          + "application"         = "access-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/am-org-role-mapping-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#am-master-builds"
          + "environment"         = "staging"
          + "managedBy"           = "AM"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.org-role-mapping-database-v15.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_am-org-role-mapping-service-postgres-db-v15-aat"
      + resource_group_name      = "am-org-role-mapping-service-postgres-db-v15-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-org-role-mapping-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/am-org-role-mapping-service-postgres-db-v15-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "access-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/am-org-role-mapping-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#am-master-builds"
          + "environment"         = "staging"
          + "managedBy"           = "AM"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.org-role-mapping-database-v15.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_am-org-role-mapping-service-postgres-db-v15-aat"
      + resource_group_name      = "am-org-role-mapping-service-postgres-db-v15-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-org-role-mapping-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/am-org-role-mapping-service-postgres-db-v15-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "access-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/am-org-role-mapping-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#am-master-builds"
          + "environment"         = "staging"
          + "managedBy"           = "AM"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.org-role-mapping-database-v15.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_am-org-role-mapping-service-postgres-db-v15-aat"
      + resource_group_name      = "am-org-role-mapping-service-postgres-db-v15-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-org-role-mapping-service-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/am-org-role-mapping-service-postgres-db-v15-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "access-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/am-org-role-mapping-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#am-master-builds"
          + "environment"         = "staging"
          + "managedBy"           = "AM"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2187,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->